docs: workspace设计
